# Tidy Data

## Exercises

### 1. Attendance Data

Load the attendance.csv file and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [33]:
import pandas as pd
import numpy as np
import seaborn as sns
from pydataset import data

In [34]:
# read in the .csv file named attendance.csv
df = pd.read_csv('untidy-data/attendance.csv')
df.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [35]:
#rename columns
df = df.rename(columns = {'Unnamed: 0': 'name'})
df

,name,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [36]:
# Melt the data. Creates two new columns 

df_tidy = pd.melt(df, id_vars='name', 
                  var_name = 'date', 
                  value_name = 'att_code')

df_tidy

     name        date att_code
0   Sally  2018-01-01        P
1    Jane  2018-01-01        A
2   Billy  2018-01-01        A
3    John  2018-01-01        P
4   Sally  2018-01-02        T
5    Jane  2018-01-02        P
6   Billy  2018-01-02        T
7    John  2018-01-02        T
8   Sally  2018-01-03        T
9    Jane  2018-01-03        T
10  Billy  2018-01-03        A
11   John  2018-01-03        H
12  Sally  2018-01-04        H
13   Jane  2018-01-04        T
14  Billy  2018-01-04        A
15   John  2018-01-04        P
16  Sally  2018-01-05        P
17   Jane  2018-01-05        T
18  Billy  2018-01-05        H
19   John  2018-01-05        P
20  Sally  2018-01-06        A
21   Jane  2018-01-06        T
22  Billy  2018-01-06        T
23   John  2018-01-06        T
24  Sally  2018-01-07        T
25   Jane  2018-01-07        A
26  Billy  2018-01-07        P
27   John  2018-01-07        P
28  Sally  2018-01-08        T
29   Jane  2018-01-08        T
30  Billy  2018-01-08        T
31   John  2018-01-08        P

In [37]:
df_tidy['att_code_value'] = df_tidy["att_code"].map(lambda x: 1 if "P" in x else 0.5 if "H" in x else 0 if "A" in x else 0.9 if "T" in x else "")

print(df_tidy)

     name        date att_code  att_code_value
0   Sally  2018-01-01        P             1.0
1    Jane  2018-01-01        A             0.0
2   Billy  2018-01-01        A             0.0
3    John  2018-01-01        P             1.0
4   Sally  2018-01-02        T             0.9
5    Jane  2018-01-02        P             1.0
6   Billy  2018-01-02        T             0.9
7    John  2018-01-02        T             0.9
8   Sally  2018-01-03        T             0.9
9    Jane  2018-01-03        T             0.9
10  Billy  2018-01-03        A             0.0
11   John  2018-01-03        H             0.5
12  Sally  2018-01-04        H             0.5
13   Jane  2018-01-04        T             0.9
14  Billy  2018-01-04        A             0.0
15   John  2018-01-04        P             1.0
16  Sally  2018-01-05        P             1.0
17   Jane  2018-01-05        T             0.9
18  Billy  2018-01-05        H             0.5
19   John  2018-01-05        P             1.0
20  Sally  2018-01-06        A             0.0
21   Jane  2018-01-06        T             0.9
22  Billy  2018-01-06        T             0.9
23   John  2018-01-06        T             0.9
24  Sally  2018-01-07        T             0.9
25   Jane  2018-01-07        A             0.0
26  Billy  2018-01-07        P             1.0
27   John  2018-01-07        P             1.0
28  Sally  2018-01-08        T             0.9
29   Jane  2018-01-08        T             0.9
30  Billy  2018-01-08        T             0.9
31   John  2018-01-08        P             1.0

In [38]:
df_total_value_attended = df_tidy.groupby('name').att_code_value.sum()

print(df_total_value_attended)

df_days_attended = df_tidy.groupby('name').date.count()

print(df_days_attended)

df_att_pct = (df_total_value_attended  / df_days_attended)

df_att_pct

name
Billy    4.2
Jane     5.5
John     7.3
Sally    6.1
Name: att_code_value, dtype: float64
name
Billy    8
Jane     8
John     8
Sally    8
Name: date, dtype: int64

name
Billy    0.5250
Jane     0.6875
John     0.9125
Sally    0.7625
dtype: float64

### 2. Coffee Levels

    a. Read the coffee_levels.csv file.
    b. Transform the data so that each carafe is in it's own column.
    c. Is this the best shape for the data?

In [39]:
# read in the .csv file named coffee_levels.csv 
df = pd.read_csv('untidy-data/coffee_levels.csv')
df.head()

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

In [46]:
# pivot the coffee_carafe column. Reset index to go from multi-index to flat dataframe.

coffee_tidy = df.pivot_table(index = ['hour'],
                                       columns = ['coffee_carafe']).reset_index()
coffee_tidy

              hour coffee_amount
coffee_carafe                  x         y         z
0                8      0.816164  0.189297  0.999264
1                9      0.451018  0.521502  0.915990
2               10      0.843279  0.023163  0.144928
3               11      0.335533  0.235529  0.311495
4               12      0.898291  0.017009  0.771947
5               13      0.310711  0.997464  0.398520
6               14      0.507288  0.058361  0.864464
7               15      0.215043  0.144644  0.436364
8               16      0.183891  0.544676  0.280621
9               17      0.391560  0.594126  0.436677

In [47]:
# c. Is this the best shape for the data? - No

### 3. Cake Recipes

     a. Read the cake_recipes.csv data. This data set contains cake tastiness scores for 
        combinations of different recipes, oven rack positions, and oven temperatures.
     b. Tidy the data as necessary.
     c. Which recipe, on average, is the best? recipe b
     d. Which oven temperature, on average, produces the best results? 275
     e. Which combination of recipe, rack position, and temperature gives the best result? 
        Recipe b, bottom rack, 300 degrees

In [48]:
# read in the .csv file named coffee_levels.csv 
df_cake = pd.read_csv('untidy-data/cake_recipes.csv')
df_cake.head()

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084